---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorRecreateFailed
source: html/de55d6ab-1f3c-1b93-a841-2604cca63c9b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.FloorRecreateFailed Property

The floor cannot be created.

## Syntax (C#)
```csharp
public static FailureDefinitionId FloorRecreateFailed { get; }
```